code-review/NRB_3471_3546/База_Было/Enums/ТипыКодовДляСверкиСтатикиЦБ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыКодовДляСверкиСтатикиЦБ</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>RuData</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>NrdCode</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ISIN</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НомерРегистрации</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

code-review/NRB_3471_3546/База_Было/CommonModules/РаботаСДаннымиBQВызовСервера/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// Возвращает тип кода и код для сверки в соответствии с алгоритмом: брать первый найденный код из списка
// "Код Рудата ЦБ", "Код НРД ЦБ", "ISIN", "Номер регистрации ЦБ" (проверять наличие в указанном порядке).
// Параметры:
//	ЦБ - СправочникСсылка.ЦенныеБумаги
// Возвращаемое значение:
//	- Структура - состоит из двух элементов - ТипКода (ПеречислениеСсылка.ТипыКодовДляСверкиСтатикиЦБ) и Код (Строка)
Функция ТипКодаИКодДляСверки(ЦБ) Экспорт
	ТипКода = Перечисления.ТипыКодовДляСверкиСтатикиЦБ.RuData;
	Код = КодЦБЗаданногоТипа(ЦБ, ТипКода);
	Если Не ЗначениеЗаполнено(Код) Тогда
		ТипКода = Перечисления.ТипыКодовДляСверкиСтатикиЦБ.NrdCode;
		Код = КодЦБЗаданногоТипа(ЦБ, ТипКода);
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Код) Тогда
		ТипКода = Перечисления.ТипыКодовДляСверкиСтатикиЦБ.ISIN;
		Код = КодЦБЗаданногоТипа(ЦБ, ТипКода);
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Код) Тогда
		ТипКода = Перечисления.ТипыКодовДляСверкиСтатикиЦБ.НомерРегистрации;
		Код = КодЦБЗаданногоТипа(ЦБ, ТипКода);
	КонецЕсли;
	
	Возврат Новый Структура("ТипКода, Код", ТипКода, Код);
КонецФункции

// Возвращает код ЦБ указанного типа
// Параметры:
//	ЦБ - СправочникСсылка.ЦенныеБумаги
//	ТипКода - ПеречислениеСсылка.ТипыКодовДляСверкиСтатикиЦБ
// Возвращаемое значение:
//	 - Строка
Функция КодЦБЗаданногоТипа(ЦБ, ТипКода) Экспорт
	Если Не ЗначениеЗаполнено(ЦБ) Или Не ЗначениеЗаполнено(ТипКода) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если ТипКода = Перечисления.ТипыКодовДляСверкиСтатикиЦБ.RuData
			Или ТипКода = Перечисления.ТипыКодовДляСверкиСтатикиЦБ.NrdCode Тогда
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	КодыЗагрузки.Код КАК Код
		|ИЗ
		|	Справочник.КодыЗагрузки КАК КодыЗагрузки
		|ГДЕ
		|	КодыЗагрузки.Владелец = &ЦБ
		|	И КодыЗагрузки.Биржа = &Классификатор
		|	И НЕ КодыЗагрузки.ПометкаУдаления
		|	И ВЫБОР
		|			КОГДА КодыЗагрузки.ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1)
		|				ТОГДА ИСТИНА
		|			КОГДА КодыЗагрузки.ДатаОкончанияДействия > &ТекущаяДата
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ ЛОЖЬ
		|		КОНЕЦ";
		Запрос.УстановитьПараметр("ЦБ", ЦБ);
		Запрос.УстановитьПараметр("Классификатор", Справочники.КлассификаторыЗагрузки[ИмяДляПолученияЗначения(ТипКода)]);
		Запрос.УстановитьПараметр("ТекущаяДата", НачалоДня(ТекущаяДатаСеанса()));
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Код = Выборка.Код;
		Иначе
			Код = Неопределено;
		КонецЕсли;
	ИначеЕсли ТипКода = Перечисления.ТипыКодовДляСверкиСтатикиЦБ.ISIN 
				Или ТипКода = Перечисления.ТипыКодовДляСверкиСтатикиЦБ.НомерРегистрации Тогда
		Код = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЦБ, ИмяДляПолученияЗначения(ТипКода));
	Иначе
		Код = Неопределено;
	КонецЕсли;
	
	Возврат Код;
КонецФункции 

// Возвращает имя (не синоним) значения
// Параметры:
//	ТипКода - ПеречислениеСсылка.ТипыКодовДляСверкиСтатикиЦБ
// Возвращаемое значение:
//	 - Строка
Функция ИмяДляПолученияЗначения(ТипКода) Экспорт
	
	Если ТипКода = Перечисления.ТипыКодовДляСверкиСтатикиЦБ.RuData Тогда
		Имя = "RuData";
	ИначеЕсли ТипКода = Перечисления.ТипыКодовДляСверкиСтатикиЦБ.NrdCode Тогда
		Имя = "NrdCode";
	ИначеЕсли ТипКода = Перечисления.ТипыКодовДляСверкиСтатикиЦБ.ISIN Тогда
		Имя = "ISIN";
	ИначеЕсли ТипКода = Перечисления.ТипыКодовДляСверкиСтатикиЦБ.НомерРегистрации Тогда
		Имя = "НомерРегистрации";
	Иначе
		Имя = "";
	КонецЕсли;
	
	Возврат Имя;
КонецФункции

// Преобразует дату в стиле BQ в дату 1С
// Параметры:
// 	ДатаBQ - Число - целое число в формате ГГГГММДД, например 20250417
// Возвращаемое значение:
//	- Дата - Дата без времени
Функция ЧислоВДату(ДатаBQ) Экспорт
	Если ДатаBQ <> 0 Тогда
		ДесятьТысяч = 10000;
		Сто = 100;
		Год = Цел(ДатаBQ / ДесятьТысяч);
		ДатаБезГода = (ДатаBQ - Год * ДесятьТысяч);
		Месяц = Цел(ДатаБезГода / Сто);
		День = ДатаБезГода - Месяц * Сто;
		Дата1С = ДАТА(Год, Месяц, День);
	Иначе
		Дата1С = ДАТА(1, 1, 1);
	КонецЕсли;
		
	Возврат Дата1С;
КонецФункции

// Преобразует дату в число представляющее дату в стиле BQ
// Параметры:
// 	Дата1С - Дата
// Возвращаемое значение:
//	- Число - представляет дату в стиле BQ (целое число в формате ГГГГММДД, например 20250417)
Функция Дата1СВДатуBQ(Дата1С) Экспорт
	СдвигНа4РазрядаВлево = 10000;
	СдвигНа2РазрядаВлево = 100;
	ДатаBQ = Год(Дата1С) * СдвигНа4РазрядаВлево + Месяц(Дата1С) * СдвигНа2РазрядаВлево + День(Дата1С);
	
	Возврат ДатаBQ;
КонецФункции

#КонецОбласти
